rails/routes_and_resources/routing-nested-resources-lab-cb-gh-000/app/controllers/artists_controller.rb

  def show
      if Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]