rails/associations_and_rails/has-many-through-forms-rails-labs-cb-gh-000/app/views/comments/_form.html.erb

SELECT "users".* FROM "users"
---

    <%= f.collection_select :user_id, User.all, :id, :username, include_blank: 'Choose a User to comment as' %>