rails/routes_and_resources/modification-nested-routes-lab-cb-gh-000/app/views/songs/_form.html.erb

  <%= f.hidden_field :artist_id %>
  <%= collection_select :song, :artist_id, Artist.all, :id, :name %>
---
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
SELECT "artists".* FROM "artists"