rails/associations_and_rails/has-many-through-forms-rails-labs-cb-gh-000/app/views/posts/show.html.erb

Comments:
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]

Users who have commented:
<% @post.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "comments" ON "users"."id" = "comments"."user_id" WHERE "comments"."post_id" = ?  [["post_id", 1]]