rails/routes_and_resources/modification-nested-routes-reading-cb-gh-000/app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "123123"], ["updated_at", "2016-02-01 06:13:05.552201"], ["id", 7]]

  def edit
    # check to see if there is author_id param
    if params[:author_id]
      @author = Author.find_by(id: params[:author_id])
      # verify that author exists
      if @author.nil?
        redirect_to authors_path, alert: "Author not found."
      # verify that author has this post
      else
        @post = author.posts.find_by(id: params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]