rails/associations_and_rails/has-many-through-forms-rails-labs-cb-gh-000/app/views/categories/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "post_categories" ON "posts"."id" = "post_categories"."post_id" WHERE "post_categories"."category_id" = ?  [["category_id", 1]]
---
Posts in this category:
<% @category.posts.each do |post| %>